_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 240, 240, 1)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 240, 240, 120)     1200      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 240, 240, 80)      86480     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 240, 240, 60)      43260     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 240, 240, 40)      21640     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 120, 120, 40)      0         
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 240, 240, 40)      0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 240, 240, 40)      14440     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 240, 240, 60)      21660     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 240, 240, 80)      43280     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 240, 240, 120)     86520     
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 240, 240, 1)       1081      
=================================================================
Total params: 319,561
Trainable params: 319,561
Non-trainable params: 0
_________________________________________________________________
