{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["conv2d_13", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 240, 240, 1]}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 20, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_5"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "max_pooling2d_5"}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 10, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_6"}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "max_pooling2d_6"}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 50, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_11"}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_5", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "up_sampling2d_5"}, {"class_name": "Conv2D", "config": {"activation": "relu", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 60, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_12"}, "inbound_nodes": [[["up_sampling2d_5", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_6", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "up_sampling2d_6"}, {"class_name": "Conv2D", "config": {"activation": "sigmoid", "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "filters": 1, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "padding": "same", "activity_regularizer": null, "name": "conv2d_13"}, "inbound_nodes": [[["up_sampling2d_6", 0, 0, {}]]], "name": "conv2d_13"}]}, "keras_version": "2.1.1"}