_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 175)       1750      
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 25, 25, 175)       109375    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 150)       656400    
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 25, 25, 150)       93750     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 150)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 21600)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 520)               11232520  
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 520)               520       
_________________________________________________________________
dense_2 (Dense)              (None, 300)               156300    
_________________________________________________________________
p_re_lu_4 (PReLU)            (None, 300)               300       
_________________________________________________________________
dense_3 (Dense)              (None, 250)               75250     
_________________________________________________________________
p_re_lu_5 (PReLU)            (None, 250)               250       
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 2008      
=================================================================
Total params: 12,328,423
Trainable params: 12,328,423
Non-trainable params: 0
_________________________________________________________________
