_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 150)       1500      
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 30, 30, 150)       135000    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 150)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 15, 100)       135100    
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 15, 15, 100)       22500     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 100)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 7, 7, 50)          45050     
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 7, 7, 50)          2450      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 3, 50)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 450)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 250)               112750    
_________________________________________________________________
p_re_lu_4 (PReLU)            (None, 250)               250       
_________________________________________________________________
dropout_1 (Dropout)          (None, 250)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 125)               31375     
_________________________________________________________________
p_re_lu_5 (PReLU)            (None, 125)               125       
_________________________________________________________________
dropout_2 (Dropout)          (None, 125)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 65)                8190      
_________________________________________________________________
p_re_lu_6 (PReLU)            (None, 65)                65        
_________________________________________________________________
dropout_3 (Dropout)          (None, 65)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 35)                2310      
_________________________________________________________________
p_re_lu_7 (PReLU)            (None, 35)                35        
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 36        
=================================================================
Total params: 496,736
Trainable params: 496,736
Non-trainable params: 0
_________________________________________________________________
