Number of Patients: 1
Block Dimensions: 8
Number of Components (k): 8


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, None, 64)          1600      
_________________________________________________________________
batch_normalization_1 (Batch (None, None, 64)          256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, None, 64)          0         
_________________________________________________________________
dense_1 (Dense)              (None, None, 750)         48750     
_________________________________________________________________
batch_normalization_2 (Batch (None, None, 750)         3000      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, None, 750)         0         
_________________________________________________________________
dense_2 (Dense)              (None, None, 500)         375500    
_________________________________________________________________
batch_normalization_3 (Batch (None, None, 500)         2000      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, None, 500)         0         
_________________________________________________________________
dense_3 (Dense)              (None, None, 250)         125250    
_________________________________________________________________
batch_normalization_4 (Batch (None, None, 250)         1000      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, None, 250)         0         
_________________________________________________________________
dense_4 (Dense)              (None, None, 100)         25100     
_________________________________________________________________
batch_normalization_5 (Batch (None, None, 100)         400       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, None, 100)         0         
_________________________________________________________________
dense_5 (Dense)              (None, None, 50)          5050      
_________________________________________________________________
batch_normalization_6 (Batch (None, None, 50)          200       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, None, 50)          0         
_________________________________________________________________
dense_6 (Dense)              (None, None, 5)           255       
=================================================================
Total params: 588,361
Trainable params: 584,933
Non-trainable params: 3,428
_________________________________________________________________
