Number of Patients (training): 180
Number of Patients (validation): 18


__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 32) 320         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 32) 128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 128, 128, 32) 524288      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 32) 9248        p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 32) 128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 128, 128, 32) 524288      batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling_with_argmax2d_1 (Ma [(None, 64, 64, 32), 0           p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
max_unpooling2d_3 (MaxUnpooling (None, 128, 128, 32) 0           max_pooling_with_argmax2d_1[0][0]
                                                                 max_pooling_with_argmax2d_1[0][1]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 128, 128, 32) 9248        max_unpooling2d_3[0][0]          
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 128, 128, 32) 128         conv2d_11[0][0]                  
__________________________________________________________________________________________________
p_re_lu_11 (PReLU)              (None, 128, 128, 32) 524288      batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 128, 128, 32) 9248        p_re_lu_11[0][0]                 
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 128, 128, 32) 128         conv2d_12[0][0]                  
__________________________________________________________________________________________________
p_re_lu_12 (PReLU)              (None, 128, 128, 32) 524288      batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 128, 128, 1)  33          p_re_lu_12[0][0]                 
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 128, 128, 1)  4           conv2d_13[0][0]                  
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 16384)     0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
permute_1 (Permute)             (None, 16384, 1)     0           reshape_1[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16384, 1)     0           permute_1[0][0]                  
==================================================================================================
Total params: 2,125,765
Trainable params: 2,125,507
Non-trainable params: 258
__________________________________________________________________________________________________
