_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 200)       2000      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 30, 30, 200)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 200)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 15, 100)       180100    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 15, 15, 100)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 100)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4900)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 175)               857675    
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 175)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               17600     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 101       
=================================================================
Total params: 1,057,476
Trainable params: 1,057,476
Non-trainable params: 0
_________________________________________________________________
