Number of Patients (training): 80
Number of Patients (validation): 8


__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 16) 160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 128, 128, 16) 64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
p_re_lu_1 (PReLU)               (None, 128, 128, 16) 262144      batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 16) 2320        p_re_lu_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 16) 64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
p_re_lu_2 (PReLU)               (None, 128, 128, 16) 262144      batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling_with_argmax2d_1 (Ma [(None, 64, 64, 16), 0           p_re_lu_2[0][0]                  
__________________________________________________________________________________________________
max_unpooling2d_2 (MaxUnpooling (None, 128, 128, 16) 0           max_pooling_with_argmax2d_1[0][0]
                                                                 max_pooling_with_argmax2d_1[0][1]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 128, 128, 16) 2320        max_unpooling2d_2[0][0]          
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 128, 128, 16) 64          conv2d_7[0][0]                   
__________________________________________________________________________________________________
p_re_lu_7 (PReLU)               (None, 128, 128, 16) 262144      batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 128, 128, 16) 2320        p_re_lu_7[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 128, 128, 16) 64          conv2d_8[0][0]                   
__________________________________________________________________________________________________
p_re_lu_8 (PReLU)               (None, 128, 128, 16) 262144      batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 1)  17          p_re_lu_8[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 128, 128, 1)  4           conv2d_9[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 16384)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
permute_1 (Permute)             (None, 16384, 1)     0           reshape_1[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16384, 1)     0           permute_1[0][0]                  
==================================================================================================
Total params: 1,055,973
Trainable params: 1,055,843
Non-trainable params: 130
__________________________________________________________________________________________________
