Number of Patients: 3
Block Dimensions: 8
Number of Components (k): 8


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              9000      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 1000)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 750)               750750    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 750)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 500)               375500    
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 500)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 250)               125250    
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 250)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 100)               25100     
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 100)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 50)                5050      
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 50)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 5)                 255       
=================================================================
Total params: 1,290,905
Trainable params: 1,290,905
Non-trainable params: 0
_________________________________________________________________
