_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 150)       1500      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 25, 25, 150)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 125)       168875    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 25, 25, 125)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 125)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 18000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 520)               9360520   
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 520)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 4168      
=================================================================
Total params: 9,535,063
Trainable params: 9,535,063
Non-trainable params: 0
_________________________________________________________________
