Number of Patients: 1
Block Dimensions: 8
Number of Components (k): 8


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 6, 64)             256       
_________________________________________________________________
batch_normalization_1 (Batch (None, 6, 64)             256       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 6, 64)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 6, 750)            48750     
_________________________________________________________________
batch_normalization_2 (Batch (None, 6, 750)            3000      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 6, 750)            0         
_________________________________________________________________
dense_2 (Dense)              (None, 6, 500)            375500    
_________________________________________________________________
batch_normalization_3 (Batch (None, 6, 500)            2000      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 6, 500)            0         
_________________________________________________________________
dense_3 (Dense)              (None, 6, 250)            125250    
_________________________________________________________________
batch_normalization_4 (Batch (None, 6, 250)            1000      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 6, 250)            0         
_________________________________________________________________
dense_4 (Dense)              (None, 6, 100)            25100     
_________________________________________________________________
batch_normalization_5 (Batch (None, 6, 100)            400       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 6, 100)            0         
_________________________________________________________________
dense_5 (Dense)              (None, 6, 50)             5050      
_________________________________________________________________
batch_normalization_6 (Batch (None, 6, 50)             200       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 6, 50)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 6, 5)              255       
=================================================================
Total params: 587,017
Trainable params: 583,589
Non-trainable params: 3,428
_________________________________________________________________
