_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 125)       1250      
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 25, 25, 125)       78125     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 100)       112600    
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 25, 25, 100)       62500     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 100)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 14400)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 300)               4320300   
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 300)               300       
_________________________________________________________________
dense_2 (Dense)              (None, 150)               45150     
_________________________________________________________________
p_re_lu_4 (PReLU)            (None, 150)               150       
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 1208      
=================================================================
Total params: 4,621,583
Trainable params: 4,621,583
Non-trainable params: 0
_________________________________________________________________
