_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 175)       1750      
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 25, 25, 175)       109375    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 140)       612640    
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 25, 25, 140)       87500     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 140)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 20160)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 520)               10483720  
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 520)               520       
_________________________________________________________________
dense_2 (Dense)              (None, 250)               130250    
_________________________________________________________________
p_re_lu_4 (PReLU)            (None, 250)               250       
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 2008      
=================================================================
Total params: 11,428,013
Trainable params: 11,428,013
Non-trainable params: 0
_________________________________________________________________
