_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 150)       1500      
_________________________________________________________________
p_re_lu_1 (PReLU)            (None, 25, 25, 150)       93750     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 125)       468875    
_________________________________________________________________
p_re_lu_2 (PReLU)            (None, 25, 25, 125)       78125     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 125)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 18000)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 520)               9360520   
_________________________________________________________________
p_re_lu_3 (PReLU)            (None, 520)               520       
_________________________________________________________________
dense_2 (Dense)              (None, 250)               130250    
_________________________________________________________________
p_re_lu_4 (PReLU)            (None, 250)               250       
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 2008      
=================================================================
Total params: 10,135,798
Trainable params: 10,135,798
Non-trainable params: 0
_________________________________________________________________
