Number of Patients: 3
Block Dimensions: 8
Number of Components (k): 50


_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_1 (Dense)              (None, 1000)              51000     
_________________________________________________________________
batch_normalization_1 (Batch (None, 1000)              4000      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 1000)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 750)               750750    
_________________________________________________________________
batch_normalization_2 (Batch (None, 750)               3000      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 750)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 500)               375500    
_________________________________________________________________
batch_normalization_3 (Batch (None, 500)               2000      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 500)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 250)               125250    
_________________________________________________________________
batch_normalization_4 (Batch (None, 250)               1000      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 250)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 100)               25100     
_________________________________________________________________
batch_normalization_5 (Batch (None, 100)               400       
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 100)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 50)                5050      
_________________________________________________________________
batch_normalization_6 (Batch (None, 50)                200       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 50)                0         
_________________________________________________________________
dense_7 (Dense)              (None, 5)                 255       
=================================================================
Total params: 1,343,505
Trainable params: 1,338,205
Non-trainable params: 5,300
_________________________________________________________________
