_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 30, 30, 150)       1500      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 30, 30, 150)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 15, 15, 150)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 15, 100)       135100    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 15, 15, 100)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 100)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4900)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 150)               735150    
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 150)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 75)                11325     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 75)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 35)                2660      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 35)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 36        
=================================================================
Total params: 885,771
Trainable params: 885,771
Non-trainable params: 0
_________________________________________________________________
