_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 100)       1000      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 75)        67575     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 75)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 10800)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 500)               5400500   
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 4008      
=================================================================
Total params: 5,473,083
Trainable params: 5,473,083
Non-trainable params: 0
_________________________________________________________________
