_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 25, 25, 125)       1250      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 25, 25, 125)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 25, 25, 100)       112600    
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 25, 25, 100)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 25, 25, 75)        67575     
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 25, 25, 75)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 75)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 10800)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 500)               5400500   
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 500)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 8)                 4008      
=================================================================
Total params: 5,585,933
Trainable params: 5,585,933
Non-trainable params: 0
_________________________________________________________________
